jmeter.log
2019-11-08 15:05:44,560 INFO o.a.j.u.JMeterUtils: Setting Locale to zh_CN
2019-11-08 15:05:44,578 INFO o.a.j.JMeter: Loading user properties from: H:\jmeter\apache-jmeter-5.1.1\bin\user.properties
2019-11-08 15:05:44,579 INFO o.a.j.JMeter: Loading system properties from: H:\jmeter\apache-jmeter-5.1.1\bin\system.properties
2019-11-08 15:05:44,582 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2019-11-08 15:05:44,583 INFO o.a.j.JMeter: Version 5.1.1 r1855137
2019-11-08 15:05:44,583 INFO o.a.j.JMeter: java.version=1.8.0_121
2019-11-08 15:05:44,583 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2019-11-08 15:05:44,583 INFO o.a.j.JMeter: os.name=Windows 10
2019-11-08 15:05:44,583 INFO o.a.j.JMeter: os.arch=amd64
2019-11-08 15:05:44,593 INFO o.a.j.JMeter: os.version=10.0
2019-11-08 15:05:44,593 INFO o.a.j.JMeter: file.encoding=GBK
2019-11-08 15:05:44,593 INFO o.a.j.JMeter: java.awt.headless=true
2019-11-08 15:05:44,593 INFO o.a.j.JMeter: Max memory     =2147483648
2019-11-08 15:05:44,593 INFO o.a.j.JMeter: Available Processors =8
2019-11-08 15:05:44,595 INFO o.a.j.JMeter: Default Locale=English (EN)
2019-11-08 15:05:44,596 INFO o.a.j.JMeter: JMeter  Locale=Chinese (China)
2019-11-08 15:05:44,596 INFO o.a.j.JMeter: JMeterHome=H:\jmeter\apache-jmeter-5.1.1
2019-11-08 15:05:44,596 INFO o.a.j.JMeter: user.dir  =H:\jmeter\workplace
2019-11-08 15:05:44,596 INFO o.a.j.JMeter: PWD       =H:\jmeter\workplace
2019-11-08 15:05:44,605 INFO o.a.j.JMeter: IP: 192.168.3.52 Name: LAPTOP-QO3IU1VG FullName: LAPTOP-QO3IU1VG
2019-11-08 15:05:44,607 INFO o.a.j.s.FileServer: Default base='H:\jmeter\workplace'
2019-11-08 15:05:44,611 INFO o.a.j.s.FileServer: Set new base='H:\jmeter\workplace'
2019-11-08 15:05:44,729 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2019-11-08 15:05:44,739 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2019-11-08 15:05:44,742 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2019-11-08 15:05:44,746 INFO o.a.j.s.SaveService: Loading file: jenkins-仓储中台1.0.4FAT.jmx
2019-11-08 15:05:44,800 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-11-08 15:05:44,800 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-11-08 15:05:44,800 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-11-08 15:05:44,800 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-11-08 15:05:44,800 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2019-11-08 15:05:44,800 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2019-11-08 15:05:45,283 INFO o.a.j.JMeter: Creating summariser <summary>
2019-11-08 15:05:45,298 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2019-11-08 15:05:45,299 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-11-08 15:05:45,299 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-11-08 15:05:45,305 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2019-11-08 15:05:45,305 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2019-11-08 15:05:45,431 INFO o.a.j.JMeter: 正在运行的测试 (1573196745431)
2019-11-08 15:05:45,472 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 认证
2019-11-08 15:05:45,472 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group 认证.
2019-11-08 15:05:45,473 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2019-11-08 15:05:45,473 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2019-11-08 15:05:45,480 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2019-11-08 15:05:45,480 INFO o.a.j.e.StandardJMeterEngine: Waiting for thread group: 认证 to finish before starting next group
2019-11-08 15:05:45,482 INFO o.a.j.t.JMeterThread: Thread started: 认证 1-1
2019-11-08 15:05:45,499 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = LAPTOP-QO3IU1VG
2019-11-08 15:05:45,504 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2019-11-08 15:05:45,505 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2019-11-08 15:05:45,506 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to utf-8
2019-11-08 15:05:45,506 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2019-11-08 15:05:45,506 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2019-11-08 15:05:46,147 INFO o.a.j.t.JMeterThread: Thread is done: 认证 1-1
2019-11-08 15:05:46,147 INFO o.a.j.t.JMeterThread: Thread finished: 认证 1-1
2019-11-08 15:05:46,148 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 2 : FAT
2019-11-08 15:05:46,148 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group FAT.
2019-11-08 15:05:46,148 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2019-11-08 15:05:46,148 INFO o.a.j.t.ThreadGroup: Starting thread group... number=2 threads=1 ramp-up=1 delayedStart=false
2019-11-08 15:05:46,155 INFO o.a.j.t.ThreadGroup: Started thread group number 2
2019-11-08 15:05:46,155 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2019-11-08 15:05:46,168 INFO o.a.j.t.JMeterThread: Thread started: FAT 2-1
2019-11-08 15:06:00,166 INFO o.a.j.r.Summariser: summary +     21 in 00:00:15 =    1.4/s Avg:   311 Min:    22 Max:   915 Err:     0 (0.00%) Active: 1 Started: 2 Finished: 1
2019-11-08 15:06:30,265 INFO o.a.j.r.Summariser: summary +     88 in 00:00:30 =    2.9/s Avg:   341 Min:    20 Max:  1978 Err:     0 (0.00%) Active: 1 Started: 2 Finished: 1
2019-11-08 15:06:30,266 INFO o.a.j.r.Summariser: summary =    109 in 00:00:45 =    2.4/s Avg:   335 Min:    20 Max:  1978 Err:     0 (0.00%)
2019-11-08 15:07:01,670 INFO o.a.j.r.Summariser: summary +     50 in 00:00:31 =    1.6/s Avg:   527 Min:    20 Max:  6369 Err:     0 (0.00%) Active: 1 Started: 2 Finished: 1
2019-11-08 15:07:01,671 INFO o.a.j.r.Summariser: summary =    159 in 00:01:16 =    2.1/s Avg:   396 Min:    20 Max:  6369 Err:     0 (0.00%)
2019-11-08 15:07:30,326 INFO o.a.j.r.Summariser: summary +     68 in 00:00:29 =    2.4/s Avg:   421 Min:   157 Max:  1637 Err:     0 (0.00%) Active: 1 Started: 2 Finished: 1
2019-11-08 15:07:30,327 INFO o.a.j.r.Summariser: summary =    227 in 00:01:45 =    2.2/s Avg:   403 Min:    20 Max:  6369 Err:     0 (0.00%)
2019-11-08 15:07:56,825 INFO o.a.j.t.JMeterThread: Thread is done: FAT 2-1
2019-11-08 15:07:56,825 INFO o.a.j.t.JMeterThread: Thread finished: FAT 2-1
2019-11-08 15:07:56,826 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2019-11-08 15:07:56,828 INFO o.a.j.r.Summariser: summary +     63 in 00:00:27 =    2.4/s Avg:   419 Min:    82 Max:  2882 Err:     4 (6.35%) Active: 0 Started: 2 Finished: 2
2019-11-08 15:07:56,829 INFO o.a.j.r.Summariser: summary =    290 in 00:02:11 =    2.2/s Avg:   407 Min:    20 Max:  6369 Err:     4 (1.38%)